# -*- ispell-dictionary: "english" -*-
:PROPERTIES:
:ID:       6d25ece7-27de-4847-a5d8-a5586c72bc6f
:CREATED:  2024-04-02T14:05:22
:REFERRER:
:END:
#+title: Well scoped lambda terms
#+LANGUAGE: english
#+PROPERTY: header-args :exports code
#+DATE: <2024-05-21 Tue>



In [cite:@scott2017], I stumbled upon the following type declarations[fn:1]:

#+begin_src haskell
data Var a = Z | S a
  deriving (Show, Functor)

data Term a = V a         -- Variable references
  | Abs (Term (Var a))    -- λ abstraction
  | App (Term a) (Term a) -- Function application
  deriving (Show, Functor)
#+end_src

This made me finally understand the "Syntax is an endofunctor on the category of
substitutions" point of view. In this post, I will try to condense as much as
possible the parts I would have needed to understand it sooner.

[fn:1]I took the liberty of simplifying it for the purpose of this article. I
also added a ~deriving~ annotation, because, as we will see later, those two type
constructors are functors.

* COMMENT Tangle this org document

#+begin_src emacs-lisp
(org-babel-tangle-file (buffer-file-name) "scoped-lambda-terms.hs" "haskell")
#+end_src

#+RESULTS:
| /home/terramorpha/org-roam/blog/scoped-lambda-terms.hs |


